{
  "SEES": "It can see you (and will run/follow)",
  "HEARS": "It can hear you",
  "GOODHEARING": "Pursues sounds more than most monsters",
  "SMELLS": "It can smell you",
  "KEENNOSE": "Keen sense of smell",
  "STUMBLES": "Stumbles in its movement",
  "WARM": "Warm blooded",
  "NOHEAD": "Headshots not allowed!",
  "HARDTOSHOOT": "It's one size smaller for ranged attacks: no less then MS_TINY",
  "GRABS": "Its attacks may grab us!",
  "BASHES": "Bashes down doors",
  "DESTROYS": "Bashes down walls and more",
  "BORES": "Tunnels through just about anything",
  "POISON": "Poisonous to eat",
  "VENOM": "Attack may poison the player",
  "BADVENOM": "Attack may SEVERELY poison the player",
  "PARALYZE": "Attack may paralyze the player with venom",
  "BLEED": "Causes player to bleed",
  "WEBWALK": "Doesn't destroy webs",
  "DIGS": "Digs through the ground",
  "CAN_DIG": "Can dig and walk",
  "FLIES": "Can fly (over water: etc)",
  "AQUATIC": "Confined to water",
  "SWIMS": "Treats water as 50 movement point terrain",
  "ATTACKMON": "Attacks other monsters",
  "ANIMAL": "Is an animal for purposes of the Animal Empath trait",
  "PLASTIC": "Absorbs physical damage to a great degree",
  "SUNDEATH": "Dies in full sunlight",
  "ELECTRIC": "Shocks unarmed attackers",
  "ACIDPROOF": "Immune to acid",
  "ACIDTRAIL": "Leaves a trail of acid",
  "SHORTACIDTRAIL": "Leaves an intermittent trail of acid",
  "FIREPROOF": "Immune to fire",
  "SLUDGEPROOF": "Ignores the effect of sludge trails",
  "SLUDGETRAIL": "Causes monster to leave a sludge trap trail when moving",
  "FIREY": "Burns stuff and is immune to fire",
  "QUEEN": "When it dies: local populations start to die off too",
  "ELECTRONIC": "e.g. a robot; affected by EMP blasts: and other stuff",
  "FUR": "May produce fur when butchered",
  "LEATHER": "May produce leather when butchered",
  "WOOL": "May produce wool when butchered",
  "FEATHER": "May produce feather when butchered",
  "BONES": "May produce bones and sinews when butchered; if combined with POISON flag: tainted bones: if combined with HUMAN: human bones",
  "FAT": "May produce fat when butchered; if combined with POISON flag: tainted fat",
  "IMMOBILE": "Doesn't move (e.g. turrets)",
  "RIDEABLE_MECH": "A rideable mech that is immobile until ridden.",
  "MILITARY_MECH": "A rideable mech that was designed for military work.",
  "MECH_RECON_VISION": "This mech gives you IR night-vision.",
  "MECH_DEFENSIVE": "This mech gives you thorough protection.",
  "HIT_AND_RUN": "Flee for several turns after a melee attack",
  "GUILT": "You feel guilty for killing it",
  "PAY_BOT": "You can pay this bot to be your friend for a time",
  "HUMAN": "It's a live human: as long as it's alive",
  "NO_BREATHE": "Creature can't drown and is unharmed by gas: smoke: or poison",
  "REGENERATES_50": "Monster regenerates very quickly over time",
  "REGENERATES_10": "Monster regenerates quickly over time",
  "REGENERATES_1": "Monster regenerates slowly over time",
  "REGENERATES_IN_DARK": "Monster regenerates very quickly in poorly lit tiles",
  "FLAMMABLE": "Monster catches fire: burns: and spreads fire to nearby objects",
  "REVIVES": "Monster corpse will revive after a short period of time",
  "CHITIN": "May produce chitin when butchered",
  "VERMIN": "Obsolete flag labeling nuisance or scenery monsters: now used to prevent loading the same.",
  "NOGIB": "Creature won't leave gibs / meat chunks when killed with huge damage.",
  "LARVA": "Creature is a larva. Currently used for gib and blood handling.",
  "ARTHROPOD_BLOOD": "Forces monster to bleed hemolymph.",
  "ACID_BLOOD": "Makes monster bleed acid. Fun stuff! Does not automatically dissolve in a pool of acid on death.",
  "BILE_BLOOD": "Makes monster bleed bile.",
  "ABSORBS": "Consumes objects it moves over which gives bonus hp.",
  "ABSORBS_SPLITS": "Consumes objects it moves over which gives bonus hp. If it gets enough bonus HP: it spawns a copy of itself.",
  "REGENMORALE": "Will stop fleeing if at max hp: and regen anger and morale to positive values.",
  "CBM_CIV": "May produce a common CBM a power CBM when butchered.",
  "CBM_POWER": "May produce a power CBM when butchered: independent of CBM_wev.",
  "CBM_SCI": "May produce a bionic from bionics_sci when butchered.",
  "CBM_OP": "May produce a bionic from bionics_op when butchered: and the power storage is mk 2.",
  "CBM_TECH": "May produce a bionic from bionics_tech when butchered.",
  "CBM_SUBS": "May produce a bionic from bionics_subs when butchered.",
  "FILTHY": "Any clothing it drops will be filthy.",
  "FISHABLE": "It is fishable.",
  "GROUP_BASH": "Monsters that can pile up against obstacles and add their strength together to break them.",
  "SWARMS": "Monsters that like to group together and form loose packs",
  "GROUP_MORALE": "Monsters that are more courageous when near friends",
  "INTERIOR_AMMO": "Monster contain's its ammo inside itself: no need to load on launch. Prevents ammo from being dropped on disable.",
  "CLIMBS": "Monsters that can climb certain terrain and furniture",
  "PACIFIST": "Monsters that will never use melee attack: useful for having them use grab without attacking the player",
  "PUSH_MON": "Monsters that can push creatures out of their way",
  "PUSH_VEH": "Monsters that can push vehicles out of their way",
  "NIGHT_INVISIBILITY": "Monsters that are invisible in poor light conditions",
  "REVIVES_HEALTHY": "When revived: this monster has full hitpoints and speed",
  "NO_NECRO": "This monster can't be revived by necros. It will still rise on its own.",
  "AVOID_DANGER_1": "This monster will path around some dangers instead of through them.",
  "AVOID_DANGER_2": "This monster will path around most dangers instead of through them.",
  "AVOID_FIRE": "This monster will path around heat-related dangers instead of through them.",
  "AVOID_FALL": "This monster will path around cliffs instead of off of them.",
  "PRIORITIZE_TARGETS": "This monster will prioritize targets depending on their danger levels",
  "NOT_HALLU": "Monsters that will NOT appear when player's producing hallucinations",
  "CATFOOD": "This monster will become friendly when fed cat food.",
  "CATTLEFODDER": "This monster will become friendly when fed cattle fodder.",
  "BIRDFOOD": "This monster will become friendly when fed bird food.",
  "CANPLAY": "This monster can be played with if it's a pet.",
  "PET_MOUNTABLE": "This monster can be mounted and ridden when tamed.",
  "PET_HARNESSABLE": "This monster can be harnessed when tamed.",
  "DOGFOOD": "This monster will become friendly when fed dog food.",
  "MILKABLE": "This monster is milkable.",
  "NO_BREED": "This monster doesn't breed: even though it has breed data",
  "PET_WONT_FOLLOW": "This monster won't follow the player automatically when tamed.",
  "DRIPS_NAPALM": "This monster ocassionally drips napalm on move",
  "DRIPS_GASOLINE": "This monster occasionally drips gasoline on move",
  "ELECTRIC_FIELD": "This monster is surrounded by an electrical field that ignites flammable liquids near it",
  "LOUDMOVES": "This monster makes move noises as if ~2 sizes louder: even if flying.",
  "CAN_OPEN_DOORS": "This monster can open doors.",
  "STUN_IMMUNE": "This monster is immune to the stun effect",
  "DROPS_AMMO": "This monster drops ammo. Check to make sure starting_ammo paramter is present for this monster type!"
}
