{
  "pain_split": "makes all of your limbs' damage even out",
  "target_attack": "deals damage to a target (ignores walls). If effect_str is included, it will add that effect (defined elsewhere in json) to the targets if able, to the body parts defined in effected_body_parts. Any aoe will manifest as a circular area centered on the target, and will only deal damage to valid_targets. (aoe does not ignore walls)",
  "projectile_attack": "similar to target_attack, except the projectile you shoot will stop short at impassable terrain. If effect_str is included, it will add that effect (defined elsewhere in json) to the targets if able, to the body parts defined in effected_body_parts.",
  "cone_attack": "fires a cone toward the target up to your range. The arc of the cone in degrees is aoe. Stops at walls. If effect_str is included, it will add that effect (defined elsewhere in json) to the targets if able, to the body parts defined in effected_body_parts.",
  "line_attack": "fires a line with width aoe toward the target, being blocked by walls on the way. If effect_str is included, it will add that effect (defined elsewhere in json) to the targets if able, to the body parts defined in effected_body_parts.",
  "area_pull": "pulls effect filtered targets toward the epicenter",
  "area_push": "pushes effect filtered targets away from the epicenter",
  "spawn_item": "spawns an item that disappear at the end of its duration. default duration is 0.",
  "teleport_random": "teleports the player randomly range spaces with aoe variation",
  "recover_energy": "recovers an energy source (defined in the effect_str) equal to damage of the spell",
  "ter_transform": "transform the terrain and furniture in an area centered at the target. The chance of any one of the points in the area of effect changing is one_in( damage ). The effect_str is the id of a ter_furn_transform.",
  "vomit": "any creature within its area of effect will instantly vomit, if it's able to do so.",
  "timed_event": "adds a timed event to the player only. NOTE: This was added only for artifact active effects. support is limited, use at your own risk",
  "explosion": "an explosion is centered on the target, with power damage() and factor aoe()/10",
  "flashbang": "a flashbang effect is centered on the target, with poewr damage() and factor aoe()/10",
  "mod_moves": "adds damage() moves to the target. can be negative to freeze the target for that amount of time",
  "map": "maps the overmap centered on the player out to a radius of aoe()",
  "morale": "gives a morale effect to all npcs or avatar within aoe, with value damage(). decay_start is duration() / 10.",
  "charm_monster": "charms a monster that has less hp than damage() for approximately duration()",
  "mutate": "mutates the target(s). if effect_str is defined, mutates toward that category instead of picking at random. the MUTATE_TRAIT flag allows effect_str to be a specific trait instead of a category. damage() / 100 is the percent chance the mutation will be successful (a value of 10000 represents 100.00%)",
  "bash": "bashes the terrain at the target. uses damage() as the strength of the bash.",
  "none": "please select a spell effect"
}